In [3]:
import numpy as np
import pandas as pd

# Seriler

In [4]:
myDictionary = {"Atıl" : 50 , "Zeynep"  : 40, "Mehmet" : 30}

In [5]:
pd.Series(myDictionary)

Atıl      50
Zeynep    40
Mehmet    30
dtype: int64

In [6]:
myList = [50,40,30]
myNames = ["Atil","Zeynep","Mehmet"]

In [7]:
pd.Series(myList)

0    50
1    40
2    30
dtype: int64

In [8]:
pd.Series(myList,myNames)

Atil      50
Zeynep    40
Mehmet    30
dtype: int64

In [9]:
pd.Series(data=myList, index=myNames)

Atil      50
Zeynep    40
Mehmet    30
dtype: int64

In [10]:
numpyArray = np.array([50,40,30])

In [11]:
pd.Series(numpyArray)

0    50
1    40
2    30
dtype: int32

In [12]:
pd.Series(numpyArray,myNames)

Atil      50
Zeynep    40
Mehmet    30
dtype: int32

In [13]:
pd.Series(["Ahmet","Ayse","Tahiri"], [1,3,2])

1     Ahmet
3      Ayse
2    Tahiri
dtype: object

In [14]:
result_1 = pd.Series([100,200,300],["Atıl","Atlas","Osman"])

In [15]:
result_1

Atıl     100
Atlas    200
Osman    300
dtype: int64

In [16]:
result_2 = pd.Series([20,10,8],["Atıl","Atlas","Osman"])

In [17]:
result_2

Atıl     20
Atlas    10
Osman     8
dtype: int64

In [18]:
result_2[1]

10

In [19]:
result_2["Atlas"]

10

In [20]:
result_2[0:1]

Atıl    20
dtype: int64

In [21]:
result_2[1:2]

Atlas    10
dtype: int64

In [22]:
result_2[0:2]

Atıl     20
Atlas    10
dtype: int64

In [23]:
result_3= result_1 + result_2

In [24]:
result_3

Atıl     120
Atlas    210
Osman    308
dtype: int64

# Data_Frame

In [25]:
data = np.random.randn(4,3)

In [26]:
dataFrame = pd.DataFrame(data)

In [27]:
type(dataFrame[0])

pandas.core.series.Series

In [28]:
dataFrame[0][1]

1.4088737249225605

In [29]:
data

array([[ 0.39996224,  1.1206032 ,  1.20235181],
       [ 1.40887372, -0.30383501,  0.55240663],
       [-1.81458459, -0.29116173, -1.62759944],
       [-0.32311799,  0.00420949,  1.34738641]])

In [30]:
dataFrame

          0         1         2
0  0.399962  1.120603  1.202352
1  1.408874 -0.303835  0.552407
2 -1.814585 -0.291162 -1.627599
3 -0.323118  0.004209  1.347386

In [31]:
newDataFrame = pd.DataFrame(data,index=["Tahiri","Zeynep","Sadık","Ahmet"],columns = ["Maas","Yas","Calışma Saatleri"])

In [32]:
newDataFrame

            Maas       Yas  Calışma Saatleri
Tahiri  0.399962  1.120603          1.202352
Zeynep  1.408874 -0.303835          0.552407
Sadık  -1.814585 -0.291162         -1.627599
Ahmet  -0.323118  0.004209          1.347386

In [33]:
newDataFrame["Yas"]

Tahiri    1.120603
Zeynep   -0.303835
Sadık    -0.291162
Ahmet     0.004209
Name: Yas, dtype: float64

In [34]:
newDataFrame[["Yas","Maas"]]

             Yas      Maas
Tahiri  1.120603  0.399962
Zeynep -0.303835  1.408874
Sadık  -0.291162 -1.814585
Ahmet   0.004209 -0.323118

In [35]:
x = newDataFrame["Yas"] + newDataFrame["Maas"]

In [36]:
x

Tahiri    1.520565
Zeynep    1.105039
Sadık    -2.105746
Ahmet    -0.318909
dtype: float64

In [37]:
newDataFrame.loc["Tahiri"]

Maas                0.399962
Yas                 1.120603
Calışma Saatleri    1.202352
Name: Tahiri, dtype: float64

In [38]:
newDataFrame.loc["Zeynep"]

Maas                1.408874
Yas                -0.303835
Calışma Saatleri    0.552407
Name: Zeynep, dtype: float64

In [39]:
newDataFrame.loc["Zeynep"] + newDataFrame.loc["Tahiri"]

Maas                1.808836
Yas                 0.816768
Calışma Saatleri    1.754758
dtype: float64

In [40]:
newDataFrame

            Maas       Yas  Calışma Saatleri
Tahiri  0.399962  1.120603          1.202352
Zeynep  1.408874 -0.303835          0.552407
Sadık  -1.814585 -0.291162         -1.627599
Ahmet  -0.323118  0.004209          1.347386

In [41]:
newDataFrame["Maas"] = 10

In [42]:
newDataFrame

        Maas       Yas  Calışma Saatleri
Tahiri    10  1.120603          1.202352
Zeynep    10 -0.303835          0.552407
Sadık     10 -0.291162         -1.627599
Ahmet     10  0.004209          1.347386

In [43]:
newDataFrame.loc["Tahiri"] = 3500

In [44]:
newDataFrame

        Maas          Yas  Calışma Saatleri
Tahiri  3500  3500.000000       3500.000000
Zeynep    10    -0.303835          0.552407
Sadık     10    -0.291162         -1.627599
Ahmet     10     0.004209          1.347386

In [45]:
newDataFrame

        Maas          Yas  Calışma Saatleri
Tahiri  3500  3500.000000       3500.000000
Zeynep    10    -0.303835          0.552407
Sadık     10    -0.291162         -1.627599
Ahmet     10     0.004209          1.347386

In [46]:
newDataFrame.drop("Yas",axis = 1)

        Maas  Calışma Saatleri
Tahiri  3500       3500.000000
Zeynep    10          0.552407
Sadık     10         -1.627599
Ahmet     10          1.347386

In [47]:
newDataFrame

        Maas          Yas  Calışma Saatleri
Tahiri  3500  3500.000000       3500.000000
Zeynep    10    -0.303835          0.552407
Sadık     10    -0.291162         -1.627599
Ahmet     10     0.004209          1.347386

In [48]:
newDataFrame.drop("Yas",axis=1,inplace = True)

In [49]:
newDataFrame

        Maas  Calışma Saatleri
Tahiri  3500       3500.000000
Zeynep    10          0.552407
Sadık     10         -1.627599
Ahmet     10          1.347386

In [50]:
newDataFrame.loc["Tahiri"]["Maas"]

3500.0

In [51]:
newDataFrame < 0

         Maas  Calışma Saatleri
Tahiri  False             False
Zeynep  False             False
Sadık   False              True
Ahmet   False             False

In [52]:
newDataFrame[newDataFrame < 0]

        Maas  Calışma Saatleri
Tahiri   NaN               NaN
Zeynep   NaN               NaN
Sadık    NaN         -1.627599
Ahmet    NaN               NaN

In [53]:
newDataFrame[newDataFrame["Calışma Saatleri"] > 0]

        Maas  Calışma Saatleri
Tahiri  3500       3500.000000
Zeynep    10          0.552407
Ahmet     10          1.347386

In [54]:
newDataFrame.drop("Ahmet")

        Maas  Calışma Saatleri
Tahiri  3500       3500.000000
Zeynep    10          0.552407
Sadık     10         -1.627599

In [55]:
newDataFrame

        Maas  Calışma Saatleri
Tahiri  3500       3500.000000
Zeynep    10          0.552407
Sadık     10         -1.627599
Ahmet     10          1.347386

In [56]:
newDataFrame.reset_index()

    index  Maas  Calışma Saatleri
0  Tahiri  3500       3500.000000
1  Zeynep    10          0.552407
2   Sadık    10         -1.627599
3   Ahmet    10          1.347386

In [57]:
DenemList = [7000,6500,8250,4500]

In [58]:
newDataFrame["Maas"]

Tahiri    3500
Zeynep      10
Sadık       10
Ahmet       10
Name: Maas, dtype: int64

In [59]:
newDataFrame.set_index("Maas")

      Calışma Saatleri
Maas
3500       3500.000000
10            0.552407
10           -1.627599
10            1.347386

In [60]:
newDataFrame

        Maas  Calışma Saatleri
Tahiri  3500       3500.000000
Zeynep    10          0.552407
Sadık     10         -1.627599
Ahmet     10          1.347386

# Multi İndexleme

In [61]:
firstIndex = ["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [62]:
innerIndex = ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [63]:
mergedIndex = list(zip(firstIndex,innerIndex))

In [64]:
mergedIndex

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [65]:
mergedIndex = pd.MultiIndex.from_tuples(mergedIndex)

In [66]:
mergedIndex

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [67]:
type(mergedIndex)

pandas.core.indexes.multi.MultiIndex

In [68]:
listem_1 = [[40,"A"],[30,"B"],[20,"C"],[10,"D"],[0,"E"],[-10,"F"]]

In [69]:
type(listem_1)

list

In [70]:
listem_1 = np.array(listem_1)

In [71]:
listem_Data_Frame = pd.DataFrame(listem_1,index = mergedIndex,columns=["Yas","Kod_Adı"])

In [72]:
listem_Data_Frame

                    Yas Kod_Adı
Simpson    Homer     40       A
           Bart      30       B
           Marge     20       C
South Park Cartman   10       D
           Kenny      0       E
           Kyle     -10       F

multi index yaparak bu görüntüyü elde edebilir. Bu arada Data Frame oluşturmak için numpy dizisi yapma zorunluluğumuz yok ilgili datayı!

In [73]:
listem_Data_Frame.loc["Simpson"].loc["Homer"]

Yas        40
Kod_Adı     A
Name: Homer, dtype: object

In [74]:
listem_Data_Frame.index.names = ["Family","Person"]

In [75]:
listem_Data_Frame

                    Yas Kod_Adı
Family     Person
Simpson    Homer     40       A
           Bart      30       B
           Marge     20       C
South Park Cartman   10       D
           Kenny      0       E
           Kyle     -10       F

In [76]:
listem_Data_Frame.index

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           names=['Family', 'Person'])

# Pandas Operasyonlar

In [77]:
sözlükVerisi = {"Istanbul" : [30,29,np.nan],"Ankara" : [20,np.nan,25],"Izmir" : [40,39,38]}

In [78]:
havaDurumuFrame =pd.DataFrame(sözlükVerisi)

In [79]:
havaDurumuFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [80]:
havaDurumuFrame.dropna()

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

nan içeren satrıalrı düşürdü

In [81]:
havaDurumuFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [82]:
havaDurumuFrame.dropna(axis = 1)

   Izmir
0     40
1     39
2     38

axis = 1 dersek kolon olarak bakar.

In [83]:
sözlükVerim = {"Istanbul" : [30,29,np.nan],"Ankara" : [20,np.nan,25],"Izmir" : [40,39,38],"Antalya" : [30,np.nan,np.nan]}

In [84]:
newDataF = pd.DataFrame(sözlükVerim)

In [85]:
newDataF

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     30.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [86]:
newDataF.dropna(axis = 1,thresh = 2)

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [87]:
newDataF.fillna(0)

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     30.0
1      29.0     0.0     39      0.0
2       0.0    25.0     38      0.0

# Group By

In [88]:
verim = {"Departman" : ["Yazılım","Yazılım","Pazarlama","Pazarlama","Finans","Finans"],
        "Çalışan İsmi" : [ "Tahiri","Sadık","Ahmet","Atıl","Burak","Zeynep",],
         "Maas" : [20000.400,7000,1000,4567,500,8000]
        }

In [89]:
frame = pd.DataFrame(verim)

In [90]:
frame

   Departman Çalışan İsmi     Maas
0    Yazılım       Tahiri  20000.4
1    Yazılım        Sadık   7000.0
2  Pazarlama        Ahmet   1000.0
3  Pazarlama         Atıl   4567.0
4     Finans        Burak    500.0
5     Finans       Zeynep   8000.0

In [91]:
xx = frame.groupby("Departman")

In [92]:
xx.count()

           Çalışan İsmi  Maas
Departman
Finans                2     2
Pazarlama             2     2
Yazılım               2     2

In [93]:
xx.mean()

              Maas
Departman
Finans      4250.0
Pazarlama   2783.5
Yazılım    13500.2

In [94]:
xx.max()

          Çalışan İsmi     Maas
Departman
Finans          Zeynep   8000.0
Pazarlama         Atıl   4567.0
Yazılım         Tahiri  20000.4

In [95]:
xx.describe()

           Maas                                                             \
          count     mean          std     min       25%      50%       75%
Departman
Finans      2.0   4250.0  5303.300859   500.0   2375.00   4250.0   6125.00
Pazarlama   2.0   2783.5  2522.249888  1000.0   1891.75   2783.5   3675.25
Yazılım     2.0  13500.2  9192.670998  7000.0  10250.10  13500.2  16750.30


               max
Departman
Finans      8000.0
Pazarlama   4567.0
Yazılım    20000.4

# Operasyonlar_2

In [96]:
excel_data_1 = {"İsim" : ["Ahmet","Mehmet","Zeynep","Atıl"],
                "Spor" : ["Koşu","Yüzme","Koşu","Basketbol"],
                "Kalori":[100,200,300,400]               
               }

In [97]:
excel_data_2 = {"İsim" : ["Osman","Levent","Atlas","Fatma"],
                "Spor" : ["Koşu","Yüzme","Koşu","Basketbol"],
                "Kalori":[200,100,50,300]               
               }

In [98]:
excel_data_3 = {"İsim" : ["Ayşe","Mahmut","Duygu","Nur"],
                "Spor" : ["Koşu","Yüzme","Badminton","Tenis"],
                "Kalori":[20,1000,500,100]               
               }

In [99]:
excel1_frame = pd.DataFrame(excel_data_1)

In [100]:
excel2_frame = pd.DataFrame(excel_data_2,index = [4,5,6,7])

In [101]:
excel3_frame = pd.DataFrame(excel_data_3,index = [8,9,10,11])

In [102]:
##datalarımız oluşturduk

In [103]:
excel1_frame

     İsim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     300
3    Atıl  Basketbol     400

In [104]:
excel2_frame

     İsim       Spor  Kalori
4   Osman       Koşu     200
5  Levent      Yüzme     100
6   Atlas       Koşu      50
7   Fatma  Basketbol     300

In [105]:
excel3_frame

      İsim       Spor  Kalori
8     Ayşe       Koşu      20
9   Mahmut      Yüzme    1000
10   Duygu  Badminton     500
11     Nur      Tenis     100

In [106]:
##concatenation
pd.concat([excel1_frame,excel2_frame,excel3_frame],axis = 0)

      İsim       Spor  Kalori
0    Ahmet       Koşu     100
1   Mehmet      Yüzme     200
2   Zeynep       Koşu     300
3     Atıl  Basketbol     400
4    Osman       Koşu     200
5   Levent      Yüzme     100
6    Atlas       Koşu      50
7    Fatma  Basketbol     300
8     Ayşe       Koşu      20
9   Mahmut      Yüzme    1000
10   Duygu  Badminton     500
11     Nur      Tenis     100

bu metot ile birleştirme işlemi yapılabilir.

## Merge

In [107]:
Vexcel_1 = {"İsim" : ["Ahmet","Mehmet","Zeynep","Atıl"],
            "Spor" : ["Koşu","Yüzme","Zeynep","Basketbol"]
           }

In [108]:
Vexcel_2 = {"İsim" : ["Ahmet","Mehmet","Zeynep","Atıl"],
            "Kalori" : [100,200,342,37]
           }

In [109]:
mergeData_1 = pd.DataFrame(Vexcel_1)

In [110]:
mergeData_2 = pd.DataFrame(Vexcel_2)

In [111]:
pd.merge(mergeData_1,mergeData_2,on = "İsim")

     İsim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep     Zeynep     342
3    Atıl  Basketbol      37

In [112]:
maasSözlük = {"Isim" : ["Atıl","Zeynep","Mehmet","Ahmet"],
              "Departman": ["Yazılım","Satış","Pazarlama","Yazılım"],
              "Maas" : [200,300,400,500]
             }

In [114]:
maasDataFrame = pd.DataFrame(maasSözlük)

In [115]:
maasDataFrame

     Isim  Departman  Maas
0    Atıl    Yazılım   200
1  Zeynep      Satış   300
2  Mehmet  Pazarlama   400
3   Ahmet    Yazılım   500

In [116]:
maasDataFrame["Departman"].unique()

array(['Yazılım', 'Satış', 'Pazarlama'], dtype=object)

In [117]:
maasDataFrame["Departman"].nunique()

3

In [118]:
maasDataFrame["Departman"].value_counts()

Yazılım      2
Satış        1
Pazarlama    1
Name: Departman, dtype: int64

In [121]:
def bruttenNete(maas):
    return maas * 0.66

In [122]:
maasDataFrame["Maas"].apply(bruttenNete)

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64

In [123]:
maasDataFrame.isnull()

    Isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [125]:
newVeri = {"Karakter Sınıfı" : ["South Park","South Park","Simpson","Simpson"],
           "Karakter Ismi"   : ["Cartman","Kenny","Homer","Bart"],
           "Karakter yas"    : [9,10,50,100]
          }

In [126]:
pivotTbale = pd.DataFrame(newVeri)

In [127]:
pivotTbale

  Karakter Sınıfı Karakter Ismi  Karakter yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart           100

In [129]:
pivotTbale.pivot_table(values = "Karakter yas",index = ["Karakter Sınıfı","Karakter Ismi"])

                               Karakter yas
Karakter Sınıfı Karakter Ismi
Simpson         Bart                    100
                Homer                    50
South Park      Cartman                   9
                Kenny                    10